[
  {
    "title": "Sympathy for the Devil",
    "year": 2023,
    "cast": [
      "Joel Kinnaman",
      "Nicolas Cage",
      "Kaiwi Lyman-Mersereau"
    ],
    "genres": [
      "Horror"
    ],
    "href": "Sympathy_for_the_Devil_(2023_film)",
    "extract": "Sympathy for the Devil is an upcoming American psychological horror film written by Luke Paradise, directed by Yuval Adler and starring Joel Kinnaman and Nicolas Cage."
  },
  {
    "title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
    "year": 2023,
    "cast": [
      "Nicolas Cantu",
      "Micah Abbey",
      "Shamon Brown Jr.",
      "Brady Noon",
      "Jackie Chan",
      "Ayo Edebiri",
      "Ice Cube",
      "Seth Rogen",
      "John Cena",
      "Hannibal Buress",
      "Rose Byrne",
      "Post Malone",
      "Paul Rudd",
      "Maya Rudolph",
      "Natasia Demetriou",
      "Giancarlo Esposito"
    ],
    "genres": [
      "Animated",
      "Superhero"
    ],
    "href": "Teenage_Mutant_Ninja_Turtles:_Mutant_Mayhem",
    "extract": "Teenage Mutant Ninja Turtles: Mutant Mayhem is an upcoming American computer-animated superhero film directed by Jeff Rowe and co-directed by Kyler Spears, from a screenplay written by Brendan O'Brien. Based on the characters created by Kevin Eastman and Peter Laird, it serves as a reboot of the Teenage Mutant Ninja Turtles film series. It is also the first theatrical animated feature based on the property since TMNT (2007). In the film, after years of being sheltered from the human world, four mutated turtle brothers—Leonardo, Michelangelo, Donatello, and Raphael —set out to be accepted as normal teenagers while taking on a mysterious crime syndicate and an army of mutants. The ensemble voice cast includes Jackie Chan, Ayo Edebiri, Ice Cube, Seth Rogen, John Cena, Paul Rudd, Natasia Demetriou, Rose Byrne, Post Malone, Hannibal Buress, Maya Rudolph, and Giancarlo Esposito.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a2/Mutant_Mayhem_poster.jpeg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Meg 2: The Trench",
    "year": 2023,
    "cast": [
      "Jason Statham",
      "Sienna Guillory",
      "Cliff Curtis"
    ],
    "genres": [
      "Science Fiction"
    ],
    "href": "Meg_2:_The_Trench",
    "extract": "Meg 2: The Trench is an upcoming science fiction film directed by Ben Wheatley, and written by Dean Georgaris, and Jon and Erich Hoeber, based on the 1999 book The Trench by Steve Alten. Serving as a sequel to the 2018 film The Meg, the film stars Jason Statham, Wu Jing, Sienna Guillory, Cliff Curtis, Skyler Samuels, Page Kennedy, Shuya Sophia Cai and Sergio Peris-Mencheta"
  },
  {
    "title": "Dreamin' Wild",
    "year": 2023,
    "cast": [
      "Casey Affleck",
      "Walton Goggins",
      "Zooey Deschanel",
      "Noah Jupe",
      "Jack Dylan Grazer",
      "Chris Messina",
      "Beau Bridges"
    ],
    "genres": [
      "Drama",
      "Biography"
    ],
    "href": "Dreamin%27_Wild",
    "extract": "Dreamin' Wild is a 2022 American biographical drama film, written, directed, and produced by Bill Pohlad. It follows the life of singer-musician brothers Donnie and Joe Emerson. It stars Casey Affleck, Walton Goggins, Zooey Deschanel, Noah Jupe, Jack Dylan Grazer, Chris Messina, and Beau Bridges."
  },
  {
    "title": "Gran Turismo",
    "year": 2023,
    "cast": [
      "David Harbour",
      "Orlando Bloom",
      "Archie Madekwe",
      "Darren Barnet",
      "Geri Halliwell Horner",
      "Djimon Hounsou"
    ],
    "genres": [
      "Drama",
      "Sports",
      "Biography",
      "Teen"
    ],
    "href": "Gran_Turismo_(film)",
    "extract": "Gran Turismo is an upcoming American biographical coming of age sports drama film directed by Neill Blomkamp from a screenplay by Jason Hall and Zach Baylin. Produced by Columbia Pictures, PlayStation Productions, Trigger Street Productions, and 2.0 Entertainment, the film is based on the video game series of the same name developed by Polyphony Digital. Also based on a true story, the film stars Archie Madekwe as Jann Mardenborough, a teenage Gran Turismo player aspiring to be a race car driver. It also stars David Harbour, Orlando Bloom, Darren Barnet, Geri Halliwell Horner, and Djimon Hounsou.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Gran_turismo_movie.jpg/320px-Gran_turismo_movie.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 180
  },
  {
    "title": "The Last Voyage of the Demeter",
    "year": 2023,
    "cast": [
      "Corey Hawkins",
      "Liam Cunningham",
      "Aisling Franciosi",
      "David Dastmalchian"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "The_Last_Voyage_of_the_Demeter",
    "extract": "The Last Voyage of the Demeter is an upcoming American supernatural horror film directed by André Øvredal. It is an adaptation of \"The Captain's Log\", a chapter from the 1897 Bram Stoker novel Dracula. The film stars Corey Hawkins, Aisling Franciosi, Liam Cunningham, and David Dastmalchian."
  },
  {
    "title": "Heart of Stone",
    "year": 2023,
    "cast": [
      "Gal Gadot",
      "Jamie Dornan",
      "Alia Bhatt",
      "Sophie Okonedo"
    ],
    "genres": [
      "Action",
      "Spy",
      "Thriller"
    ],
    "href": "Heart_of_Stone_(2023_film)",
    "extract": "Heart of Stone is an upcoming American spy action thriller film directed by Tom Harper from a screenplay by Greg Rucka and Allison Schroeder and a story by Rucka. The film stars Gal Gadot, Jamie Dornan, and Alia Bhatt."
  },
  {
    "title": "Blue Beetle",
    "year": 2023,
    "cast": [
      "Xolo Maridueña",
      "Adriana Barraza",
      "Damián Alcázar",
      "Elpidia Carrillo",
      "Bruna Marquezine",
      "Raoul Max Trujillo",
      "Susan Sarandon",
      "George Lopez"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "Blue_Beetle_(film)",
    "extract": "Blue Beetle is an upcoming American superhero film based on the DC Comics character Jaime Reyes / Blue Beetle, produced by DC Studios and the Safran Company, and directed by Angel Manuel Soto from a screenplay by Gareth Dunnet-Alcocer. It is intended to be the 14th film in the DC Extended Universe (DCEU). The film stars Xolo Maridueña as Jaime Reyes / Blue Beetle alongside Adriana Barraza, Damián Alcázar, Elpidia Carrillo, Bruna Marquezine, Raoul Max Trujillo, Susan Sarandon, and George Lopez.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c1/Blue_Beetle_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "White Bird: A Wonder Story",
    "year": 2023,
    "cast": [
      "Ariella Glaser",
      "Orlando Schwerdt",
      "Bryce Gheisar",
      "Gillian Anderson",
      "Helen Mirren"
    ],
    "genres": [
      "Drama",
      "War"
    ],
    "href": "White_Bird:_A_Wonder_Story",
    "extract": "White Bird: A Wonder Story is an upcoming American war drama film directed by Marc Forster and written by Mark Bomback, based on the 2019 graphic novel of the same name by R. J. Palacio. A spin-off, prequel and \"companion piece\" to the 2017 coming-of-age film Wonder, based on Palacio's 2012 novel, the film stars Ariella Glaser, Orlando Schwerdt, Bryce Gheisar, Gillian Anderson, and Helen Mirren, with Gheisar reprising his role as Julian from Wonder.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/da/White_Bird_-_A_Wonder_Story_film_poster.png",
    "thumbnail_width": 264,
    "thumbnail_height": 394
  },
  {
    "title": "Please Don't Destroy",
    "year": 2023,
    "cast": [
      "John Higgins",
      "Martin Herlihy"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "Please_Don%27t_Destroy#Filmography",
    "extract": "Please Don't Destroy is a comedy group in New York City consisting of Ben Marshall, John Higgins, and Martin Herlihy, who began collaborating as students at New York University. The group was originally founded in 2017 and based on an act titled Please Don't Destroy My Farm. The troupe performed monthly comedy shows, appeared at the New York Comedy Festival and produced sketch videos posted to YouTube. During the COVID-19 pandemic, they began creating shorter videos for TikTok and Twitter."
  },
  {
    "title": "The Hill",
    "year": 2023,
    "cast": [
      "Colin Ford",
      "Dennis Quaid",
      "Joelle Carter",
      "Scott Glenn"
    ],
    "genres": [
      "Drama",
      "Sports",
      "Biography"
    ],
    "href": "The_Hill_(2023_film)",
    "extract": "The Hill is an upcoming American biographical sports drama film directed by Jeff Celentano and written by Angelo Pizzo and Scott Marshall Smith. It stars Dennis Quaid, Colin Ford, Joelle Carter, Randy Houser, Bonnie Bedelia and Scott Glenn.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/07/The_Hill_2023_Poster.png",
    "thumbnail_width": 255,
    "thumbnail_height": 377
  },
  {
    "title": "Lift",
    "year": 2023,
    "cast": [
      "Kevin Hart",
      "Gugu Mbatha-Raw",
      "Vincent D’Onofrio",
      "Úrsula Corberó",
      "Billy Magnussen",
      "Jacob Batalon",
      "Jean Reno",
      "Sam Worthington"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Thriller"
    ],
    "href": "Lift_(2023_film)",
    "extract": "Lift is an upcoming American heist action comedy thriller film directed by F. Gary Gray, written by Dan Kunka and Jeremy Doner, and co-produced by and starring Kevin Hart with Gugu Mbatha-Raw, Vincent D’Onofrio, Úrsula Corberó, Billy Magnussen, Jacob Batalon, Jean Reno, and Sam Worthington."
  },
  {
    "title": "They Listen",
    "year": 2023,
    "cast": [
      "John Cho",
      "Katherine Waterston"
    ],
    "genres": [
      "Horror"
    ],
    "href": "They_Listen",
    "extract": "They Listen is an upcoming American horror film written and directed by Chris Weitz. It stars Katherine Waterston, John Cho and Lukita Maxwell. Jason Blum and Weitz produce through their Blumhouse Productions and Depth of Field banners respectively, alongside Andrew Miano."
  },
  {
    "title": "The Equalizer 3",
    "year": 2023,
    "cast": [
      "Denzel Washington",
      "Dakota Fanning"
    ],
    "genres": [
      "Action"
    ],
    "href": "The_Equalizer_3",
    "extract": "The Equalizer 3 is an upcoming American vigilante action film directed by Antoine Fuqua. It is the sequel to the 2018 film The Equalizer 2, which was based on the TV series of the same name. The film stars Denzel Washington, Dakota Fanning, Sonia Ammar and Remo Girone. Washington and Fanning reuniting on-screen for the first time since 2004's Man on Fire. It follows retired U.S. Marine and former CIA officer Robert McCall. The film is the fifth collaboration between Washington and Fuqua, following Training Day (2001), The Equalizer (2014), The Magnificent Seven (2016), and The Equalizer 2 (2018)."
  },
  {
    "title": "The Nun 2",
    "year": 2023,
    "cast": [
      "Storm Reid",
      "Taissa Farmiga",
      "Anna Popplewell"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "The_Nun_2",
    "extract": "The Nun 2 is an upcoming American gothic supernatural horror film directed by Michael Chaves and written by Akela Cooper, Ian Goldberg, and Richard Naing from a story by Cooper. It serves as the sequel to The Nun (2018) and the ninth installment in The Conjuring Universe franchise. The film stars Storm Reid, Taissa Farmiga, and Anna Popplewell. Wan and Peter Safran return as co-producers, with Judson Scott also serving as a producer."
  },
  {
    "title": "My Big Fat Greek Wedding 3",
    "year": 2023,
    "cast": [
      "Nia Vardalos",
      "John Corbett",
      "Louis Mandylor",
      "Elena Kampouris",
      "Maria Vacratsis",
      "Andrea Martin",
      "Elias Kacavas",
      "Gia Carides",
      "Joey Fatone",
      "Melina Kotselou"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "My_Big_Fat_Greek_Wedding_3",
    "extract": "My Big Fat Greek Wedding 3 is an upcoming American romantic comedy film written and directed by Nia Vardalos. The film stars Vardalos, John Corbett, Elena Kampouris, Andrea Martin, and Lainie Kazan. It is the third installment in the My Big Fat Greek Wedding series. Filming began on June 22, 2022 in Athens, Greece, and wrapped on August 10."
  },
  {
    "title": "A Haunting in Venice",
    "year": 2023,
    "cast": [
      "Kyle Allen",
      "Kenneth Branagh",
      "Camille Cottin",
      "Jamie Dornan",
      "Tina Fey",
      "Jude Hill",
      "Kelly Reilly",
      "Michelle Yeoh"
    ],
    "genres": [
      "Mystery"
    ],
    "href": "A_Haunting_in_Venice",
    "extract": "A Haunting in Venice is an upcoming American mystery film directed by Kenneth Branagh, based on Hallowe'en Party by Agatha Christie. The film is a sequel to Murder on the Orient Express (2017) and Death on the Nile (2022). Branagh reprises his role as Hercule Poirot, alongside Kyle Allen, Camille Cottin, Jamie Dornan, Tina Fey, Jude Hill, Kelly Reilly, and Michelle Yeoh.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/A_Haunting_in_Venice_logo.jpg/320px-A_Haunting_in_Venice_logo.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 216
  },
  {
    "title": "Challengers",
    "year": 2023,
    "cast": [
      "Zendaya",
      "Mike Faist",
      "Josh O'Connor"
    ],
    "genres": [
      "Comedy",
      "Sports",
      "Romance"
    ],
    "href": "Challengers_(film)",
    "extract": "Challengers is an upcoming American romantic sports comedy film directed by Luca Guadagnino from a screenplay by Justin Kuritzkes. Its cast includes Zendaya, Mike Faist, and Josh O'Connor."
  },
  {
    "title": "The Expendables 4",
    "year": 2023,
    "cast": [
      "Jason Statham",
      "50 Cent",
      "Megan Fox",
      "Dolph Lundgren",
      "Randy Couture",
      "Tony Jaa",
      "Iko Uwais",
      "Jacob Scipio",
      "Levy Tran",
      "Andy García",
      "Sylvester Stallone"
    ],
    "genres": [
      "Action"
    ],
    "href": "The_Expendables_4",
    "extract": "The Expendables 4 is an upcoming American action film directed by Scott Waugh, with a script co-written by Kurt Wimmer, Tad Daggerhart and Max Adams, from an original story by Kurt Wimmer, Spenser Cohen and Tad Daggerhart. It is the fourth installment in The Expendables franchise and the sequel to The Expendables 3 (2014), starring an ensemble cast including Jason Statham, Dolph Lundgren, Randy Couture, and Sylvester Stallone reprising their roles from previous films, alongside 50 Cent, Megan Fox, Andy García, Tony Jaa, Jacob Scipio, Iko Uwais, Levy Tran and Eddie Hall."
  },
  {
    "title": "The Book of Clarence",
    "year": 2023,
    "cast": [
      "LaKeith Stanfield",
      "Omar Sy",
      "RJ Cyler",
      "Benedict Cumberbatch",
      "James McAvoy",
      "Caleb McLaughlin",
      "Anna Diop",
      "David Oyelowo",
      "Alfre Woodard",
      "Marianne Jean-Baptiste"
    ],
    "genres": [],
    "href": "The_Book_of_Clarence",
    "extract": "The Book of Clarence is an upcoming American epic film written and directed by Jeymes Samuel. The film is due for release on September 22, 2023."
  },
  {
    "title": "Next Goal Wins",
    "year": 2023,
    "cast": [
      "Michael Fassbender",
      "Oscar Kightley",
      "David Fane",
      "Beulah Koale",
      "Lehi Falepapalangi",
      "Semu Filipo",
      "Uli Latukefu",
      "Rachel House",
      "Kaimana",
      "Will Arnett",
      "Elisabeth Moss"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Sports"
    ],
    "href": "Next_Goal_Wins_(2023_film)",
    "extract": "Next Goal Wins is an upcoming sports comedy-drama film directed by Taika Waititi, who co-wrote the screenplay with Iain Morris. The film is based on the 2014 documentary of the same name by Mike Brett and Steve Jamison about Dutch-American coach Thomas Rongen's efforts to lead the American Samoa national football team, considered the weakest football team in the world, to qualification for the 2014 FIFA World Cup."
  },
  {
    "title": "PAW Patrol: The Mighty Movie",
    "year": 2023,
    "cast": [
      "Kristen Bell",
      "Christian Convery",
      "Mckenna Grace",
      "Lil Rel Howery",
      "James Marsden",
      "Serena Williams",
      "Taraji P. Henson",
      "Kim Kardashian",
      "Marsai Martin",
      "Ron Pardo"
    ],
    "genres": [
      "Action",
      "Adventure",
      "Animated",
      "Comedy"
    ],
    "href": "PAW_Patrol:_The_Mighty_Movie",
    "extract": "PAW Patrol: The Mighty Movie is an upcoming Canadian computer-animated action-adventure comedy film based on the television series PAW Patrol created by Keith Chapman. Produced by Spin Master Entertainment, the toy company behind the series, with animation provided by Mikros Image, and released by Paramount Pictures and Nickelodeon Movies, it is the sequel to the 2021 film PAW Patrol: The Movie and the second film under the Spin Master Entertainment banner. Directed by Cal Brunker and written by Bob Barlen, it features elements from the Mighty Pups sub-theme of the main show. In the film, the PAW Patrol pups, who are given superpowers when a magical meteor crash lands in Adventure City, must stop the supervillains when Mayor Humdinger escaped from prison and teams up with Victoria Vance by planning to steal the superpowers for themselves, before its too late."
  },
  {
    "title": "Kraven the Hunter",
    "year": 2023,
    "cast": [
      "Aaron Taylor-Johnson",
      "Ariana DeBose",
      "Alessandro Nivola",
      "Fred Hechinger",
      "Levi Miller",
      "Christopher Abbott",
      "Russell Crowe"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "Kraven_the_Hunter_(film)",
    "extract": "Kraven the Hunter is an upcoming American superhero film based on the Marvel Comics character of the same name, produced by Columbia Pictures in association with Marvel. Distributed by Sony Pictures Releasing, it is intended to be the fourth film in Sony's Spider-Man Universe (SSU). The film is being directed by J. C. Chandor from a screenplay by Art Marcum & Matt Holloway and Richard Wenk, and stars Aaron Taylor-Johnson in the title role alongside Ariana DeBose and Fred Hechinger.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Kraven_the_Hunter_%28film%29.jpg/320px-Kraven_the_Hunter_%28film%29.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 107
  },
  {
    "title": "Killers of the Flower Moon",
    "year": 2023,
    "cast": [
      "Leonardo DiCaprio",
      "Robert De Niro",
      "Jesse Plemons",
      "Lily Gladstone",
      "Brendan Fraser",
      "John Lithgow"
    ],
    "genres": [
      "Crime",
      "Drama",
      "Western"
    ],
    "href": "Killers_of_the_Flower_Moon_(film)",
    "extract": "Killers of the Flower Moon is an upcoming American Western crime drama film directed by Martin Scorsese, from a screenplay he co-wrote with Eric Roth, based on the best-selling 2017 non-fiction book Killers of the Flower Moon: The Osage Murders and the Birth of the FBI by David Grann. Its plot centers on a series of Oklahoma murders in the Osage Nation during the 1920s, committed after oil was discovered on tribal land. The film stars Leonardo DiCaprio, who also serves as an executive producer, alongside Jesse Plemons, Lily Gladstone, Brendan Fraser, John Lithgow and Robert De Niro. It marks the seventh collaboration between Scorsese and DiCaprio as well as the eleventh collaboration between Scorsese and De Niro."
  },
  {
    "title": "True Love",
    "year": 2023,
    "cast": [
      "John David Washington",
      "Gemma Chan",
      "Ralph Ineson",
      "Allison Janney",
      "Ken Watanabe"
    ],
    "genres": [
      "Science Fiction"
    ],
    "href": "True_Love_(2023_film)",
    "extract": "True Love is an upcoming American science fiction film directed, written and co-produced by Gareth Edwards. The film stars John David Washington, Gemma Chan, Ralph Ineson, Allison Janney, and Ken Watanabe."
  },
  {
    "title": "Untitled The Exorcist film",
    "year": 2023,
    "cast": [
      "Leslie Odom Jr.",
      "Ellen Burstyn",
      "Ann Dowd"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "Untitled_The_Exorcist_film",
    "extract": "The untitled The Exorcist film is an upcoming American supernatural horror film directed by David Gordon Green, with a screenplay he co-wrote with Peter Sattler, from a story he co-authored with Scott Teems and Danny McBride. It stars Leslie Odom Jr., Ellen Burstyn, Ann Dowd and Jennifer Nettles."
  },
  {
    "title": "Damsel",
    "year": 2023,
    "cast": [
      "Millie Bobby Brown",
      "Angela Bassett",
      "Robin Wright",
      "Ray Winstone",
      "Nick Robinson",
      "Brooke Carter",
      "Shohreh Aghdashloo"
    ],
    "genres": [
      "Fantasy"
    ],
    "href": "Damsel_(2023_film)",
    "extract": "Damsel is an upcoming American fantasy film directed by Juan Carlos Fresnadillo, written by Dan Mazeau, and starring Millie Bobby Brown, Nick Robinson, Angela Bassett, Robin Wright, Ray Winstone, Brooke Carter, and Shohreh Aghdashloo. It is set for release on Netflix on October 13, 2023."
  },
  {
    "title": "Ordinary Angels",
    "year": 2023,
    "cast": [
      "Hilary Swank",
      "Alan Ritchson",
      "Emily Mitchell",
      "Skywalker Hughes"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Ordinary_Angels_(film)",
    "extract": "Ordinary Angels is an upcoming American drama film directed by Jon Gunn and starring Hilary Swank, Alan Ritchson, Emily Mitchell, and Nancy Travis."
  },
  {
    "title": "Dumb Money",
    "year": 2023,
    "cast": [
      "Paul Dano",
      "Sebastian Stan",
      "Seth Rogen",
      "Pete Davidson",
      "Shailene Woodley",
      "America Ferrera",
      "Anthony Ramos",
      "Vincent D'Onofrio",
      "Dane DeHaan",
      "Nick Offerman",
      "Clancy Brown"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Biography"
    ],
    "href": "Dumb_Money",
    "extract": "Dumb Money is an upcoming American biographical comedy-drama film directed by Craig Gillespie, from a script by Lauren Schuker Blum and Rebecca Angelo, based on the book The Antisocial Network: The GameStop Short Squeeze and the Ragtag Group of Amateur Traders That Brought Wall Street to Its Knees by Ben Mezrich. The film chronicles the GameStop short squeeze from January 2021, and stars an ensemble cast featuring Paul Dano, Sebastian Stan, Seth Rogen, and Pete Davidson. Teddy Schwarzman, Aaron Ryder, and Gillespie are producing the project. The film will be released theatrically on October 20, 2023, by Stage 6 Films and Sony Pictures Releasing."
  },
  {
    "title": "The Underdoggs",
    "year": 2023,
    "cast": [
      "Snoop Dogg",
      "Tika Sumpter",
      "Mike Epps",
      "Andrew Schulz",
      "George Lopez"
    ],
    "genres": []
  },
  {
    "title": "Five Nights at Freddy's",
    "year": 2023,
    "cast": [
      "Josh Hutcherson",
      "Matthew Lillard",
      "Mary Stuart Masterson",
      "Elizabeth Lail"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "Five_Nights_at_Freddy%27s_(film)",
    "extract": "Five Nights at Freddy's is an upcoming American supernatural horror film directed by Emma Tammi, from a screenplay she co-wrote with Scott Cawthon and Seth Cuddeback, based on the video game franchise of the same name created and developed by Cawthon. It stars Josh Hutcherson, Matthew Lillard, Mary Stuart Masterson, Piper Rubio, Kat Conner Sterling, and Elizabeth Lail."
  },
  {
    "title": "Saw X",
    "year": 2023,
    "cast": [
      "Tobin Bell",
      "Shawnee Smith",
      "Synnøve Macody Lund",
      "Steven Brand",
      "Michael Beach"
    ],
    "genres": [
      "Horror"
    ],
    "href": "Saw_X",
    "extract": "Saw X is an upcoming American horror film directed by Kevin Greutert and written by Josh Stolberg and Peter Goldfinger. The film is the tenth installment overall in the Saw film series, and stars Tobin Bell, Shawnee Smith, Synnøve Macody Lund, Steven Brand, and Michael Beach."
  },
  {
    "title": "Pain Hustlers",
    "year": 2023,
    "cast": [
      "Emily Blunt",
      "Chris Evans",
      "Andy Garcia",
      "Catherine O’Hara",
      "Jay Duplass",
      "Brian d’Arcy James"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Pain_Hustlers",
    "extract": "Pain Hustlers is an upcoming American conspiracy drama film directed by David Yates from a screenplay by Wells Tower, based on a 2018 New York Times Magazine article, \"The Pain Hustlers\", by Evan Hughes and his subsequent novel The Hard Sell released in 2022. It stars Emily Blunt, Chris Evans, Andy García, Catherine O'Hara, Jay Duplass, Brian d'Arcy James, and Chloe Coleman."
  },
  {
    "title": "Dune: Part Two",
    "year": 2023,
    "cast": [
      "Timothée Chalamet",
      "Zendaya",
      "Rebecca Ferguson",
      "Josh Brolin",
      "Stellan Skarsgård",
      "Dave Bautista",
      "Stephen McKinley Henderson",
      "Charlotte Rampling",
      "Javier Bardem",
      "Florence Pugh",
      "Austin Butler",
      "Christopher Walken",
      "Léa Seydoux",
      "Souheila Yacoub",
      "Tim Blake Nelson"
    ],
    "genres": [
      "Science Fiction"
    ],
    "href": "Dune:_Part_Two",
    "extract": "Dune: Part Two is an upcoming American epic science fiction film directed by Denis Villeneuve from a screenplay by Villeneuve, Jon Spaihts, and Eric Roth. The direct sequel to the 2021 film, it is the second of a two-part adaptation of the 1965 novel Dune by Frank Herbert and will cover roughly the second half of the book. Timothée Chalamet, Rebecca Ferguson, Josh Brolin, Stellan Skarsgård, Dave Bautista, Stephen McKinley Henderson, Zendaya, Charlotte Rampling, and Javier Bardem reprise their roles from the first film, with Florence Pugh, Austin Butler, Christopher Walken, Léa Seydoux, Souheila Yacoub, and Tim Blake Nelson joining the ensemble cast."
  },
  {
    "title": "The Marvels",
    "year": 2023,
    "cast": [
      "Brie Larson",
      "Teyonah Parris",
      "Iman Vellani",
      "Zawe Ashton",
      "Samuel L. Jackson"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "The_Marvels",
    "extract": "The Marvels is an upcoming American superhero film based on Marvel Comics featuring the characters Carol Danvers / Captain Marvel, Kamala Khan / Ms. Marvel, and Monica Rambeau. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is intended to be the sequel to the film Captain Marvel (2019), a continuation of the television series Ms. Marvel (2022), and the 33rd film in the Marvel Cinematic Universe (MCU). The film is directed by Nia DaCosta from a screenplay she co-wrote with Megan McDonnell, Elissa Karasik, and Zeb Wells. It stars Brie Larson as Carol Danvers, Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau, alongside Samuel L. Jackson. In the film, Danvers, Khan, and Rambeau begin swapping places with each other every time they use their powers and must team-up.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7a/The_Marvels_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Chicken Run: Dawn of the Nugget",
    "year": 2023,
    "cast": [
      "Zachary Levi",
      "Thandiwe Newton",
      "Bella Ramsey",
      "Romesh Ranganathan",
      "David Bradley",
      "Daniel Mays",
      "Jane Horrocks",
      "Imelda Staunton",
      "Lynn Ferguson",
      "Nick Mohammed"
    ],
    "genres": [
      "Adventure",
      "Animated",
      "Comedy"
    ],
    "href": "Chicken_Run:_Dawn_of_the_Nugget",
    "extract": "Chicken Run is a 2000 stop-motion animated adventure comedy film produced by Pathé and Aardman Animations in partnership with DreamWorks Animation. Aardman's first feature-length film, it was directed by Peter Lord and Nick Park from a screenplay by Karey Kirkpatrick and based on an original story by Lord and Park. The film stars the voices of Julia Sawalha, Mel Gibson, Tony Haygarth, Miranda Richardson, Phil Daniels, Lynn Ferguson, Timothy Spall, Imelda Staunton, and Benjamin Whitrow. The plot centres on a group of British anthropomorphic chickens who see an American rooster named Rocky Rhodes as their only hope to escape the farm when their owners want to turn them into meat pies.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/0/00/Chicken_run_ver1.jpg/320px-Chicken_run_ver1.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 228
  },
  {
    "title": "The Killer",
    "year": 2023,
    "cast": [
      "Michael Fassbender",
      "Charles Parnell",
      "Arliss Howard",
      "Sophie Charlotte",
      "Tilda Swinton"
    ],
    "genres": [
      "Action",
      "Noir",
      "Thriller"
    ],
    "href": "The_Killer_(2023_film)",
    "extract": "The Killer is an upcoming American neo-noir action thriller film directed by David Fincher and with a screenplay by Andrew Kevin Walker. The film is based on the French graphic novel series of the same name by Alexis Nolent and Luc Jacamon. The film stars Michael Fassbender, Charles Parnell, Arliss Howard, Sophie Charlotte, and Tilda Swinton."
  },
  {
    "title": "The Holdovers",
    "year": 2023,
    "cast": [
      "Paul Giamatti",
      "Dominic Sessa",
      "Da'Vine Joy Randolph",
      "Carrie Preston"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "The_Holdovers",
    "extract": "The Holdovers is an upcoming American comedy-drama film directed by Alexander Payne, written by David Hemingson and starring Paul Giamatti."
  },
  {
    "title": "The Hunger Games: The Ballad of Songbirds and Snakes",
    "year": 2023,
    "cast": [
      "Tom Blyth",
      "Rachel Zegler",
      "Josh Andrés Rivera",
      "Hunter Schafer",
      "Jason Schwartzman",
      "Burn Gorman",
      "Peter Dinklage",
      "Viola Davis"
    ],
    "genres": [
      "Action",
      "Science Fiction"
    ],
    "href": "The_Hunger_Games:_The_Ballad_of_Songbirds_and_Snakes",
    "extract": "The Hunger Games: The Ballad of Songbirds and Snakes is an upcoming American science fiction action film directed by Francis Lawrence from a screenplay by Michael Arndt and Michael Lesslie, based on the 2020 novel The Ballad of Songbirds and Snakes by Suzanne Collins. It is the fifth installment in The Hunger Games film series, serving as a prequel to The Hunger Games (2012). The film stars Tom Blyth, Rachel Zegler, Josh Andrés Rivera, Hunter Schafer, Jason Schwartzman, Burn Gorman, Peter Dinklage, and Viola Davis. Set 64 years before the first film, it follows the origins of Coriolanus Snow (Blyth) and his relationship with a young Hunger Games tribute Lucy Gray Baird (Zegler), which lead him on the path to becoming the tyrannical leader of Panem.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b5/Hunger_games_the_ballad_of_songbirds_and_snakes.png",
    "thumbnail_width": 255,
    "thumbnail_height": 393
  },
  {
    "title": "Trolls Band Together",
    "year": 2023,
    "cast": [
      "Anna Kendrick",
      "Justin Timberlake",
      "Kenan Thompson",
      "Kunal Nayyar",
      "Camila Cabello",
      "Troye Sivan",
      "Kid Cudi",
      "Andrew Rannells",
      "Amy Schumer",
      "Daveed Diggs",
      "RuPaul",
      "Zosia Mamet"
    ],
    "genres": [
      "Animated",
      "Comedy",
      "Musical"
    ],
    "href": "Trolls_Band_Together",
    "extract": "Trolls Band Together is an upcoming American computer-animated musical comedy film produced by DreamWorks Animation and distributed by Universal Pictures, based on the Good Luck Trolls dolls from Thomas Dam. It is directed by Walt Dohrn and co-directed by Tim Heitz, from a screenplay by Elizabeth Tippet and the writing team of Jonathan Aibel and Glenn Berger. The film serves as the sequel to Trolls World Tour (2020) and the third installment in the Trolls franchise. Anna Kendrick, Justin Timberlake, Zooey Deschanel, Christopher Mintz-Plasse, Icona Pop, Anderson .Paak, Ron Funches, Kenan Thompson, Kunal Nayyar, and Dohrn reprise their voice roles from its predecessors, with newcomers Eric André, Kid Cudi, Daveed Diggs, Troye Sivan, Camila Cabello, Amy Schumer, Andrew Rannells, RuPaul, and Zosia Mamet joining the ensemble voice cast. In the film, Poppy (Kendrick) and Branch (Timberlake), who are officially a couple, attempt to rescue Floyd (Sivan) while reuniting Branch's brothers after the boyband phenomenon, BroZone, was disbanded.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bd/Trolls3film.jpg",
    "thumbnail_width": 251,
    "thumbnail_height": 397
  },
  {
    "title": "A Family Affair",
    "year": 2023,
    "cast": [
      "Nicole Kidman",
      "Zac Efron",
      "Joey King",
      "Liza Koshy",
      "Kathy Bates"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "A_Family_Affair_(2023_film)",
    "extract": "A Family Affair is an upcoming American romantic comedy film directed by Richard LaGravenese and written by Carrie Solomon. The film stars Nicole Kidman, Zac Efron, Joey King, Liza Koshy, and Kathy Bates."
  },
  {
    "title": "Thanksgiving",
    "year": 2023,
    "cast": [
      "Addison Rae",
      "Patrick Dempsey",
      "Gina Gershon"
    ],
    "genres": [
      "Slasher"
    ],
    "href": "Thanksgiving_(upcoming_film)",
    "extract": "Thanksgiving is an upcoming American slasher film directed by Eli Roth and produced by Roger Birnbaum, from a screenplay written by Roth and Jeff Rendell. It is based on Roth's mock trailer of the same name from Grindhouse (2007). The film stars Addison Rae and Patrick Dempsey."
  },
  {
    "title": "Wish",
    "year": 2023,
    "cast": [
      "Ariana DeBose",
      "Alan Tudyk"
    ],
    "genres": [
      "Animated"
    ],
    "href": "List_of_Walt_Disney_Animation_Studios_films#Upcoming_films",
    "extract": "Walt Disney Animation Studios is an American animation studio headquartered in Burbank, California, the original feature film division of The Walt Disney Company. The studio's films are also often called \"Disney Classics\", or \"Disney Animated Canon\"."
  },
  {
    "title": "Napoleon",
    "year": 2023,
    "cast": [
      "Joaquin Phoenix",
      "Vanessa Kirby",
      "Tahar Rahim"
    ],
    "genres": [
      "Drama",
      "Historical"
    ],
    "href": "Napoleon_(2023_film)",
    "extract": "Napoleon is an upcoming epic historical drama film directed and produced by Ridley Scott and written by David Scarpa. It stars Joaquin Phoenix as Napoleon and depicts the French leader's rise to power. The film is scheduled to be theatrically released by Sony Pictures Releasing on November 22, 2023, before streaming on Apple TV+ at a later date."
  },
  {
    "title": "Leo",
    "year": 2023,
    "cast": [
      "Adam Sandler",
      "Bill Burr",
      "Cecily Strong",
      "Jason Alexander",
      "Rob Schneider"
    ],
    "genres": []
  },
  {
    "title": "Leave the World Behind",
    "year": 2023,
    "cast": [
      "Julia Roberts",
      "Mahershala Ali",
      "Ethan Hawke",
      "Myha'la Herrold",
      "Farrah Mackenzie",
      "Charlie Evans",
      "Kevin Bacon"
    ],
    "genres": [
      "Thriller"
    ],
    "href": "Leave_the_World_Behind_(film)",
    "extract": "Leave the World Behind is an upcoming psychological thriller film written, directed and produced by Sam Esmail, based on the 2020 the novel of the same name by Rumaan Alam. The film stars Julia Roberts, Mahershala Ali, Ethan Hawke, Myha'la Herrold, Farrah Mackenzie, Charlie Evans, and Kevin Bacon."
  },
  {
    "title": "Magazine Dreams",
    "year": 2023,
    "cast": [
      "Jonathan Majors",
      "Haley Bennett",
      "Taylour Paige",
      "Mike O'Hearn",
      "Harrison Page",
      "Harriet Sansom Harris"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Magazine_Dreams",
    "extract": "Magazine Dreams is a 2023 American drama film written and directed by Elijah Bynum. It stars Jonathan Majors, Haley Bennett, Taylour Paige, Mike O'Hearn, Harrison Page and Harriet Sansom Harris."
  },
  {
    "title": "Wonka",
    "year": 2023,
    "cast": [
      "Timothée Chalamet",
      "Keegan-Michael Key",
      "Sally Hawkins",
      "Jim Carter",
      "Matt Lucas",
      "Natasha Rothwell",
      "Olivia Colman",
      "Rowan Atkinson"
    ],
    "genres": [
      "Fantasy",
      "Musical"
    ],
    "href": "Wonka_(film)",
    "extract": "Wonka is an upcoming musical fantasy film directed by Paul King, who co-wrote the screenplay with Simon Farnaby. The film serves as a prequel to the 1964 novel Charlie and the Chocolate Factory by Roald Dahl and stars Timothée Chalamet as the titular character, following his early days as an eccentric chocolatier. Keegan-Michael Key, Rowan Atkinson, Sally Hawkins, Olivia Colman, and Jim Carter star in supporting roles."
  },
  {
    "title": "Aquaman and the Lost Kingdom",
    "year": 2023,
    "cast": [
      "Jason Momoa",
      "Amber Heard",
      "Willem Dafoe",
      "Patrick Wilson",
      "Dolph Lundgren",
      "Yahya Abdul-Mateen II",
      "Temuera Morrison",
      "Nicole Kidman"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "Aquaman_and_the_Lost_Kingdom",
    "extract": "Aquaman and the Lost Kingdom is an upcoming American superhero film based on the DC Comics character Aquaman. Produced by DC Studios, the Safran Company, and Atomic Monster Productions, and set for distribution by Warner Bros. Pictures, it is intended to be the sequel to Aquaman (2018), and the 15th and final installment in the DC Extended Universe (DCEU). The film is directed by James Wan from a screenplay written by David Leslie Johnson-McGoldrick, and stars Jason Momoa as Arthur Curry / Aquaman alongside Amber Heard, Willem Dafoe, Patrick Wilson, Dolph Lundgren, Yahya Abdul-Mateen II, Temuera Morrison, and Nicole Kidman.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/Aquaman_and_the_Lost_Kingdom_logo.jpg/320px-Aquaman_and_the_Lost_Kingdom_logo.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 163
  },
  {
    "title": "Untitled Ghostbusters: Afterlife sequel",
    "year": 2023,
    "cast": [
      "Mckenna Grace",
      "Carrie Coon",
      "Finn Wolfhard",
      "Paul Rudd",
      "Celeste O'Connor",
      "Logan Kim",
      "Bill Murray",
      "Dan Aykroyd",
      "Ernie Hudson",
      "Sigourney Weaver",
      "Annie Potts",
      "Patton Oswalt",
      "Kumail Nanjiani"
    ],
    "genres": [
      "Comedy",
      "Supernatural"
    ],
    "href": "Untitled_Ghostbusters:_Afterlife_sequel",
    "extract": "The untitled Ghostbusters: Afterlife sequel is an upcoming American supernatural comedy film directed by Gil Kenan from a screenplay co-written by Jason Reitman and Kenan. It serves as the sequel to Ghostbusters: Afterlife (2021), and the fifth film in the Ghostbusters franchise. The film stars Finn Wolfhard, Mckenna Grace, Celeste O'Connor, Carrie Coon, Paul Rudd and Ernie Hudson reprising their roles, with new additions to the cast including Kumail Nanjiani, Patton Oswalt, James Acaster and Emily Alyn Lind."
  },
  {
    "title": "Rebel Moon",
    "year": 2023,
    "cast": [
      "Sofia Boutella",
      "Charlie Hunnam",
      "Ray Fisher",
      "Djimon Hounsou",
      "Jena Malone",
      "Corey Stoll",
      "Ed Skrein",
      "Cleopatra Coleman",
      "Fra Fee",
      "Cary Elwes",
      "Anthony Hopkins"
    ],
    "genres": [
      "Science Fiction"
    ],
    "href": "Rebel_Moon",
    "extract": "Rebel Moon is an upcoming American epic space opera film directed by Zack Snyder from a screenplay he co-wrote with Shay Hatten and Kurt Johnstad, based on a story he also created with Johnstad. Produced by The Stone Quarry and Grand Electric, and distributed by Netflix. The film features an ensemble cast that includes Sofia Boutella, Charlie Hunnam, Ray Fisher, Djimon Hounsou, Jena Malone, Corey Stoll, Ed Skrein, Cleopatra Coleman, Fra Fee, Cary Elwes, and Anthony Hopkins."
  },
  {
    "title": "Migration",
    "year": 2023,
    "cast": [],
    "genres": [],
    "href": "Migration_(2023_film)",
    "extract": "This is a list of productions produced by Illumination, an American film and animation studio based in Santa Monica, California, United States. This includes feature films, television specials, shorts, and digital series. As of 2023, Illumination has released 13 feature films, which were all distributed by Universal Pictures, with their first being Despicable Me on July 9, 2010, and their latest being The Super Mario Bros. Movie on April 5, 2023."
  },
  {
    "title": "The Color Purple",
    "year": 2023,
    "cast": [
      "Fantasia Barrino",
      "Colman Domingo",
      "Corey Hawkins",
      "Danielle Brooks",
      "H.E.R.",
      "Halle Bailey",
      "Ciara",
      "Aunjanue Ellis",
      "Deon Cole",
      "Elizabeth Marvel",
      "Jon Batiste",
      "Louis Gossett Jr.",
      "David Alan Grier",
      "Taraji P. Henson"
    ],
    "genres": [
      "Drama",
      "Musical",
      "Historical"
    ],
    "href": "The_Color_Purple_(2023_film)",
    "extract": "The Color Purple is an upcoming American musical coming-of-age period drama film directed by Blitz Bazawule and adapted for the screen by Marcus Gardley from the 2005 stage musical of the same name, which is in turn based on Alice Walker's 1982 Pulitzer Prize-winning novel of the same name. It is the second film adaptation of the novel, following Steven Spielberg's 1985 film adaptation. Spielberg and Quincy Jones return to produce this version, along with the stage musical's producers Scott Sanders and Oprah Winfrey, the latter of whom also starred in the 1985 film as Sofia."
  }
]
